In [24]:
import pandas as pd
import numpy as np

# Crear un DataFrame de ejemplo, con valores aleatorios
df = pd.DataFrame({
    'A': np.random.randint(1, 11, 5),
    'B': np.random.randint(1, 11, 5)
})


df['C'] = df['A'] + df['B']
df

   A  B   C
0  6  8  14
1  2  1   3
2  5  4   9
3  7  2   9
4  3  9  12

In [28]:
df['potencia'] = df['A'] ** df['B']
df

   A  B   C  potencia
0  6  8  14   1679616
1  2  1   3         2
2  5  4   9       625
3  7  2   9        49
4  3  9  12     19683

In [32]:
promedio_potencia = df['potencia'].mean()
maxima_potencia = df['potencia'].max()
minima_potencia = df['potencia'].min()
print("El promedio de la potencia es: ", promedio_potencia)
print("La potencia máxima es: ", maxima_potencia)
print("La potencia mínima es: ", minima_potencia)

El promedio de la potencia es:  339995.0
La potencia máxima es:  1679616
La potencia mínima es:  2

In [39]:
### Podemos crear nuestras funciones vectorizadas

def potencia(a, b):
    return a ** b

df['potencia'] = potencia(df['A'], df['B'])
serie_potencia = list(map(potencia, df['A'], df['B']))
print(serie_potencia)

[1679616, 2, 625, 49, 19683]

In [47]:
serie_precio_btc_usd = pd.Series([10000, 11000, 12000, 13000, 14000])

serie_precio_btc_mxn = serie_precio_btc_usd * 18.41

print(serie_precio_btc_usd)
print(serie_precio_btc_mxn)

0    10000
1    11000
2    12000
3    13000
4    14000
dtype: int64
0    184100.0
1    202510.0
2    220920.0
3    239330.0
4    257740.0
dtype: float64

In [59]:
def cadena_completa(precio_btc_mxn):
    return 'El precio del btc en pesos mexicanos es: ' + str(precio_btc_mxn)

type(serie_precio_btc_mxn)
nueva_serie = map(lambda x: 'El precio del btc en pesos mexicanos es: ' + str(x), serie_precio_btc_mxn)
serie_precio_btc_mxn_cadena = pd.Series(nueva_serie)
serie_precio_btc_mxn_cadena

0    El precio del btc en pesos mexicanos es: 184100.0
1    El precio del btc en pesos mexicanos es: 202510.0
2    El precio del btc en pesos mexicanos es: 220920.0
3    El precio del btc en pesos mexicanos es: 239330.0
4    El precio del btc en pesos mexicanos es: 257740.0
dtype: object

  Estudiante      Materia  Calificación
0        Ana  Matemáticas            85
1        Ana     Historia            90
2        Ana     Ciencias            78
3       Luis  Matemáticas            88
4       Luis     Historia            85
5       Luis     Ciencias            92
6      María  Matemáticas            90
7      María     Historia            88
8      María     Ciencias            85